RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2s.c
    SET_REG32_BIT(I2Sx->CTRL, u32ResetType);
    CLEAR_REG32_BIT(I2Sx->CTRL, u32ResetType);
}

/**
 * @brief  Set the transfer mode for the I2S communication.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Mode                 Transfer mode
 *         This parameter can be one of the following values:
 *           @arg I2S_TRANS_MD_HALF_DUPLEX_RX:  Receive only and half duplex mode
 *           @arg I2S_TRANS_MD_HALF_DUPLEX_TX:  Send only and half duplex mode
 *           @arg I2S_TRANS_MD_FULL_DUPLEX:     Full duplex mode
 * @retval None
 */
void I2S_SetTransMode(M4_I2S_TypeDef *I2Sx, uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_TRANS_MD(u32Mode));

    MODIFY_REG32(I2Sx->CTRL, (I2S_CTRL_DUPLEX | I2S_CTRL_SDOE), u32Mode);
}

/**
 * @brief  Set the transfer FIFO level of I2S.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Level                Transfer FIFO level
 *         This parameter can be one of the following values:
 *           @arg I2S_TRANS_LVL0:       Transfer FIFO level is 0
 *           @arg I2S_TRANS_LVL1:       Transfer FIFO level is 1
 *           @arg I2S_TRANS_LVL2:       Transfer FIFO level is 2
 *           @arg I2S_TRANS_LVL3:       Transfer FIFO level is 3
 *           @arg I2S_TRANS_LVL4:       Transfer FIFO level is 4
 * @retval None
 */
void I2S_SetTransFIFOLevel(M4_I2S_TypeDef *I2Sx, uint32_t u32Level)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_TRANS_LVL(u32Level));

    MODIFY_REG32(I2Sx->CTRL, I2S_CTRL_TXBIRQWL, u32Level);
}

/**
 * @brief  Set the receive FIFO level of I2S.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Level                Receive FIFO level
 *         This parameter can be one of the following values:
 *           @arg I2S_RECEIVE_LVL0:     Receive FIFO level is 0
 *           @arg I2S_RECEIVE_LVL1:     Receive FIFO level is 1
 *           @arg I2S_RECEIVE_LVL2:     Receive FIFO level is 2
 *           @arg I2S_RECEIVE_LVL3:     Receive FIFO level is 3
 *           @arg I2S_RECEIVE_LVL4:     Receive FIFO level is 4
 * @retval None
 */
void I2S_SetReceiveFIFOLevel(M4_I2S_TypeDef *I2Sx, uint32_t u32Level)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_RECEIVE_LVL(u32Level));

    MODIFY_REG32(I2Sx->CTRL, I2S_CTRL_RXBIRQWL, u32Level);
}

/**
 * @brief  Set the communication protocol of I2S.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Protocol             Communication protocol
 *         This parameter can be one of the following values:
 *           @arg I2S_COM_PROTOCOL_PHILLIPS:    Phillips protocol
 *           @arg I2S_COM_PROTOCOL_MSB:         MSB justified protocol
 *           @arg I2S_COM_PROTOCOL_LSB:         LSB justified protocol
 *           @arg I2S_COM_PROTOCOL_PCM_SHORT:   PCM short-frame protocol
 *           @arg I2S_COM_PROTOCOL_PCM_LONG:    PCM long-frame protocol
 * @retval None
 */
void I2S_SetComProtocol(M4_I2S_TypeDef *I2Sx, uint32_t u32Protocol)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_COM_PROTOCOL(u32Protocol));

    MODIFY_REG32(I2Sx->CFGR, (I2S_CFGR_I2SSTD | I2S_CFGR_PCMSYNC), u32Protocol);
}

/**
 * @brief  Set the audio frequency for the I2S communication.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Freq                 Audio frequency
 *         This parameter can be 'I2S_AUDIO_FREQ_DEFAULT' or between
 *         'I2S_AUDIO_FREQ_8K' and 'I2S_AUDIO_FREQ_192K':
 *           @arg I2S_AUDIO_FREQ_192K:          FS = 192000Hz
 *           @arg I2S_AUDIO_FREQ_8K:            FS = 8000Hz
 *           @arg I2S_AUDIO_FREQ_DEFAULT
 * @retval An en_result_t enumeration value:
 *           - Ok: Set success
 *           - Error: Set failed
 */
en_result_t I2S_SetAudioFreq(M4_I2S_TypeDef *I2Sx, uint32_t u32Freq)
{
    en_result_t enRet  = Ok;
    uint32_t u32I2sClk;
    uint32_t u32Temp;
    uint32_t u32I2sDiv = 2UL;
    uint32_t u32I2sOdd = 0UL;
    uint32_t u32ChLen;

    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_AUDIO_FREQ(u32Freq));

    if (I2S_AUDIO_FREQ_DEFAULT != u32Freq)
    {
        /* Get I2S source Clock frequency */
        if (I2S_CLK_SRC_EXT == READ_REG32_BIT(I2Sx->CTRL, I2S_CTRL_CLKSEL))
        {
            /* If an external I2S clock has to be used, this define
                should be set in the ddl_config.h file */
            u32I2sClk = I2S_EXT_CLK_FREQ;
        }
        else
        {
            u32I2sClk = I2S_GetClockFreq(I2Sx);
        }

        /* The actual frequency division value is calculated according to the output state of MCK */
        if (I2S_CH_LEN_16BIT != READ_REG32_BIT(I2Sx->CFGR, I2S_CFGR_CHLEN))
        {
            u32ChLen = 32UL;
        }
        else
        {
            u32ChLen = 16UL;
        }

        if (I2S_MCK_OUTPUT_ENABLE == READ_REG32_BIT(I2Sx->CTRL, I2S_CTRL_MCKOE))
        {
            if (I2S_CH_LEN_16BIT != READ_REG32_BIT(I2Sx->CFGR, I2S_CFGR_CHLEN))
            {
                u32Temp = (((u32I2sClk / (u32ChLen*2U * 4U)) * 10U) / u32Freq) + 5U;
            }
            else
            {
                u32Temp = (((u32I2sClk / (u32ChLen*2U * 8U)) * 10U) / u32Freq) + 5U;
            }
        }
        else
        {
            u32Temp = (((u32I2sClk / (u32ChLen*2U)) * 10U) / u32Freq) + 5U;
        }
        u32Temp   = u32Temp / 10U;
        u32I2sOdd = u32Temp & 0x01U;
        u32I2sDiv = (u32Temp - u32I2sOdd) / 2U;
    }

    if ((u32I2sDiv < 2U) || (u32I2sDiv > 0xFFU))
    {
        enRet = Error;
    }
    else
    {
        /* Set clock division */
        WRITE_REG32(I2Sx->PR, u32I2sDiv);
        MODIFY_REG32(I2Sx->CTRL, I2S_CTRL_ODD, (u32I2sOdd << I2S_CTRL_ODD_POS));
    }

    return enRet;
}

/**
 * @brief  Enable or disable MCK clock output.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] enNewState              The function new state
 *           @arg This parameter can be: Enable or Disable.
 * @retval None
 */
void I2S_MCKOutputCmd(M4_I2S_TypeDef *I2Sx, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

