RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_i2s.c
    if (Disable != enNewState)
    {
        SET_REG32_BIT(I2Sx->CTRL, u32IntType);
    }
    else
    {
        CLEAR_REG32_BIT(I2Sx->CTRL, u32IntType);
    }
}

/**
 * @brief  Get I2S flag status.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Flag                 I2S flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg I2S_FLAG_TX_ALARM:    Transfer buffer alarm flag
 *           @arg I2S_FLAG_RX_ALARM:    Receive buffer alarm flag
 *           @arg I2S_FLAG_TX_EMPTY:    Transfer buffer empty flag
 *           @arg I2S_FLAG_TX_FULL:     Transfer buffer full flag
 *           @arg I2S_FLAG_RX_EMPTY:    Receive buffer empty flag
 *           @arg I2S_FLAG_RX_FULL:     Receive buffer full flag
 *           @arg I2S_FLAG_TX_ERR:      Transfer overflow or underflow flag
 *           @arg I2S_FLAG_RX_ERR:      Receive overflow flag
 *           @arg I2S_FLAG_ALL:         All of the above
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t I2S_GetStatus(const M4_I2S_TypeDef *I2Sx, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = Reset;
    uint32_t u32NormalFlag;
    uint32_t u32ErrorFlag;

    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_FLAG(u32Flag));

    u32NormalFlag = u32Flag & 0xFFFFUL;
    u32ErrorFlag  = u32Flag >> 16U;
    if (0UL != u32NormalFlag)
    {
        if (0UL != (READ_REG32_BIT(I2Sx->SR, u32NormalFlag)))
        {
            enFlagSta = Set;
        }
    }
    if ((Reset == enFlagSta) && (0UL != u32ErrorFlag))
    {
        if (0UL != (READ_REG32_BIT(I2Sx->ER, u32ErrorFlag)))
        {
            enFlagSta = Set;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Clear I2S flag.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Flag                 I2S flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg I2S_FLAG_TX_ERR:      Transfer overflow or underflow flag
 *           @arg I2S_FLAG_RX_ERR:      Receive overflow flag
 *           @arg I2S_CLR_FLAG_ALL:     All of the above
 * @retval None
 */
void I2S_ClearStatus(M4_I2S_TypeDef *I2Sx, uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_I2S_UNIT(I2Sx));
    DDL_ASSERT(IS_I2S_CLR_FLAG(u32Flag));

    CLEAR_REG32_BIT(I2Sx->ER, u32Flag);
}

/**
 * @brief  Get I2S clock frequency.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @retval uint32_t                     The I2S clock frequency
 */
static uint32_t I2S_GetClockFreq(const M4_I2S_TypeDef *I2Sx)
{
    uint32_t u32ClockShift;
    uint16_t u32ClockSrc;
    uint32_t u32ClockFreq;
    uint32_t u32PllP;
    uint32_t u32PllQ;
    uint32_t u32PllR;
    uint32_t u32PllN;
    uint32_t u32PllM;
    uint32_t u32PllIn;
    uint32_t u32Temp;

    /* Get the offset of the I2S clock source in CMU_I2SCKSEL */
    if (M4_I2S1 == I2Sx)
    {
        u32ClockShift = CMU_I2SCKSEL_I2S1CKSEL_POS;
    }
    else if (M4_I2S2 == I2Sx)
    {
        u32ClockShift = CMU_I2SCKSEL_I2S2CKSEL_POS;
    }
    else if (M4_I2S3 == I2Sx)
    {
        u32ClockShift = CMU_I2SCKSEL_I2S3CKSEL_POS;
    }
    else if (M4_I2S4 == I2Sx)
    {
        u32ClockShift = CMU_I2SCKSEL_I2S4CKSEL_POS;
    }
    else
    {
        u32ClockShift = 0UL;
    }

    u32ClockSrc = (READ_REG16(M4_CMU->I2SCKSEL) >> u32ClockShift) & CMU_I2SCKSEL_I2S1CKSEL;
    if (0UL != READ_REG32_BIT(M4_CMU->PLLHCFGR, CMU_PLLHCFGR_PLLSRC))
    {
        u32PllIn = HRC_VALUE;
    }
    else
    {
        u32PllIn = XTAL_VALUE;
    }
    /* Calculate the clock frequency */
    switch(u32ClockSrc)
    {
        case 0x00U:  /* PCLK1 */
            u32ClockFreq = SystemCoreClock >> ((READ_REG32_BIT(M4_CMU->SCFGR, CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS));
            break;
        case 0x08U:  /* PLLHQ */
            u32Temp = READ_REG32(M4_CMU->PLLHCFGR);
            u32PllM = (u32Temp >> CMU_PLLHCFGR_PLLHM_POS) & 0x03UL;
            u32PllN = (u32Temp >> CMU_PLLHCFGR_PLLHN_POS) & 0xFFUL;
            u32PllQ = (u32Temp >> CMU_PLLHCFGR_PLLHQ_POS) & 0x0FUL;
            u32ClockFreq = ((u32PllIn / (u32PllM + 1UL)) * (u32PllN + 1UL)) / (u32PllQ + 1UL);
            break;
        case 0x09U:  /* PLLHR */
            u32Temp = READ_REG32(M4_CMU->PLLHCFGR);
            u32PllM = (u32Temp >> CMU_PLLHCFGR_PLLHM_POS) & 0x03UL;
            u32PllN = (u32Temp >> CMU_PLLHCFGR_PLLHN_POS) & 0xFFUL;
            u32PllR = (u32Temp >> CMU_PLLHCFGR_PLLHR_POS) & 0x0FUL;
            u32ClockFreq = ((u32PllIn / (u32PllM + 1UL)) * (u32PllN + 1UL)) / (u32PllR + 1UL);
            break;
        case 0x0AU:  /* PLLAP */
            u32Temp = READ_REG32(M4_CMU->PLLACFGR);
            u32PllM = (u32Temp >> CMU_PLLACFGR_PLLAM_POS) & 0x1FUL;
            u32PllN = (u32Temp >> CMU_PLLACFGR_PLLAN_POS) & 0x1FFUL;
            u32PllP = (u32Temp >> CMU_PLLACFGR_PLLAP_POS) & 0x0FUL;
            u32ClockFreq = ((u32PllIn / (u32PllM + 1UL)) * (u32PllN + 1UL)) / (u32PllP + 1UL);
            break;
        case 0x0BU:  /* PLLAQ */
            u32Temp = READ_REG32(M4_CMU->PLLACFGR);
            u32PllM = (u32Temp >> CMU_PLLACFGR_PLLAM_POS) & 0x1FUL;
            u32PllN = (u32Temp >> CMU_PLLACFGR_PLLAN_POS) & 0x1FFUL;
            u32PllQ = (u32Temp >> CMU_PLLACFGR_PLLAQ_POS) & 0x0FUL;
            u32ClockFreq = ((u32PllIn / (u32PllM + 1UL)) * (u32PllN + 1UL)) / (u32PllQ + 1UL);
            break;
        case 0x0CU:  /* PLLAR */
            u32Temp = READ_REG32(M4_CMU->PLLACFGR);
            u32PllM = (u32Temp >> CMU_PLLACFGR_PLLAM_POS) & 0x1FUL;
            u32PllN = (u32Temp >> CMU_PLLACFGR_PLLAN_POS) & 0x1FFUL;
            u32PllR = (u32Temp >> CMU_PLLACFGR_PLLAR_POS) & 0x0FUL;
            u32ClockFreq = ((u32PllIn / (u32PllM + 1UL)) * (u32PllN + 1UL)) / (u32PllR + 1UL);
            break;
        default:
            u32ClockFreq = 0UL;
            break;
    }

    return u32ClockFreq;
}

/**
 * @brief  Wait for the flag status of I2S.
 * @param  [in] I2Sx                    Pointer to I2S instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_I2S1:              I2S unit 1 instance register base
 *           @arg M4_I2S2:              I2S unit 2 instance register base
 *           @arg M4_I2S3:              I2S unit 3 instance register base
 *           @arg M4_I2S4:              I2S unit 4 instance register base
 * @param  [in] u32Flag                 I2S flag type
 *         This parameter can be one of the following values:
 *           @arg I2S_FLAG_TX_ALARM:    Transfer buffer alarm flag
 *           @arg I2S_FLAG_RX_ALARM:    Receive buffer alarm flag
 *           @arg I2S_FLAG_TX_EMPTY:    Transfer buffer empty flag
 *           @arg I2S_FLAG_TX_FULL:     Transfer buffer full flag
 *           @arg I2S_FLAG_RX_EMPTY:    Receive buffer empty flag
 *           @arg I2S_FLAG_RX_FULL:     Receive buffer full flag
 *           @arg I2S_FLAG_TX_ERR:      Transfer overflow or underflow flag
 *           @arg I2S_FLAG_RX_ERR:      Receive overflow flag
 * @param  [in] enStatus                The flag status
 *         This parameter can be one of the following values:
 *         @arg Set:                    Wait for the flag to set
 *         @arg Reset:                  Wait for the flag to reset
 * @param  [in] u32Timeout              Wait the flag timeout(ms)
 * @retval An en_result_t enumeration value:
 *           - Ok: Wait status success
 *           - ErrorTimeout: Wait timeout
 */
static en_result_t I2S_WaitStatus(const M4_I2S_TypeDef *I2Sx, uint32_t u32Flag, en_flag_status_t enStatus, uint32_t u32Timeout)
{
    en_result_t enRet  = Ok;
    __IO uint32_t u32Count;

    /* Waiting for the flag status to change to the enStatus */
    u32Count = u32Timeout * (HCLK_VALUE / 20000UL);
    while (enStatus != I2S_GetStatus(I2Sx, u32Flag))
    {
        if (u32Count == 0UL)
        {
            enRet = ErrorTimeout;
            break;
        }
        u32Count--;
    }

    return enRet;
}

/**
 * @}
 */

#endif /* DDL_I2S_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
